  //=============================================================================
//
// メッシュ地面の処理 [meshfield.h]
// Author : 麦英泳
//
//=============================================================================
#ifndef _MESHFIELD_H_
#define _MESHFIELD_H_

#include "function.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

HRESULT InitMeshField();
void UninitMeshField(void);
void UpdateMeshField(void);
void DrawMeshField(void);

#endif
