//=============================================================================
//
// タイトル画面処理 [title.h]
// Author : 麦英泳
//
//=============================================================================
#ifndef _TITLE_H_
#define _TITLE_H_

#include "function.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTitle(void);
void UninitTitle(void);
void UpdateTitle(void);
void DrawTitle(void);

//1p2pの選択答えをゲット
int GetCursorIdx(void);
#endif
